// Angular
import {Component, ElementRef, OnInit, Renderer2, ViewEncapsulation} from '@angular/core';
// Layout
import {LayoutConfigService, SplashScreenService, TranslationService} from '../../../core/_base/layout';
// Auth
import {AuthNoticeService} from '../../../core/auth';
import {QuestionsEditDialogComponent} from '../questions/questions-view/questions-edit/questions-edit.dialog.component';
import {MatDialog} from '@angular/material';
import {InfoDialogComponent} from './info-popup/info.dialog.component';
import {ActivatedRoute} from '@angular/router';

@Component({
	selector: 'kt-auth',
	templateUrl: './auth.component.html',
	styleUrls: ['./auth.component.scss'],
	encapsulation: ViewEncapsulation.None
})
export class AuthComponent implements OnInit {
	// Public properties
	today: number = Date.now();
	headerLogo: string;
	info = [
		`تمثّل هذه الشروط والأحكام بالإضافة إلى أيّ  شرط  من الشروط المحددة في إشعارات المسابقة (كما هو موضح أدناه) شروط المسابقة باشتراكهم في المسابقة، يوافق المشاركون على الالتزام بهذه الشروط.`,
		`يتم تنظيم المسابقة من شركة يونفيرس تيليكوم او من يثلها .`,
		`تحتفظ يونفيرس  بحقها في إلغاء أو تعديل المسابقة أو الشروط دون إشعار مسبق في حالة وقوع كارثة، حرب، اضطرابات مدنية أو عسكرية، قضاء وقدر أو أي خرق فعلي أو متوقع لأي قانون معمول به أو أي ظرف آخر خارج عن نطاق سيطرة يونفيرس. وسوف يتم نشر أي تغييرات سواء ضمن هذه الشروط والأحكام أو ضمن إشعار المسابقة.`,
		` في حالة حدوث أي نزاع حول الشروط والسلوك والنتائج وكافة الأمور الأخرى المتعلقة بالمسابقة، فإن قرار يونفيرس  يعتبر نهائياً ولن يتم قبول أي مناقشات أو مراسلات في هذا الخصوص.`,
		`المؤهلون للمشاركة b`,
		` هو كل من يقوم بتنفيذ الخطوات المطلوبة من طرف منظم المسابقة ، وبحق ليونفيرس قبول او رفض او تعديل أي شرط كما تراه مناسبا ودون ابداء الأسباب .`,
		`بالاشتراك في المسابقة، تتعهد بأن تكون جميع المعلومات التي قدمتها لنا صحيحة وحديثة وكاملة. و تحتفظ يونفيرس  لنفسها بالحق في التصرف بالمعلومات المقدمة باي طريقة تجارية تعود بالنفع عليها ولا تعود بالضرر على صاحبها`,
		`العنوان الذي تقدمه عند اشتراكك في المسابقة ("المشاركة") سيتم استخدامه لإرسال أية جوائز، لذا يرجى التأكد من أن هذا هو العنوان الصحيح. وما لم ينص إشعار المسابقة على خلاف ذلك، تكون المسابقات مفتوحة فقط للمقيمين في فسطين (الضفة الغربية ) واراضي ال 48  وليس لك الحق في الاشتراك في المسابقة إذا كنت مقيماً خارج هذه المناطق، وليست يونفيرس ملزمة بقبول اشتراكك`,
		`بما أن المسابقة مفتوحة لجميع الفئات العمرية، تفترض يونفيرس  أنه باستخدامك للانترنت واشتراكك في المسابقة (وأنت تتعهد بذلك) بأن سنك هو 18 عاماً أو أكثر. وفي حال كان عمرك أقل من 18 عاماً، أن والديك قد وافقا على اشتراكك في المسابقة وهذه القواعد.  وإذا  كانت المسابقة مفتوحة فقط لفئة عمرية معينة (مثل 18 فما فوق)، سيتم ذكر ذلك في إشعار المسابقة وتفترض يونفيرس  أنه عند اشتراكك في المسابقة (وأنت تتعهد بذلك) بأنك في سن مناسبة للاشتراك فيها.`,
		`تحتفظ يونفيرس  بالحق في استبعاد أي مشارك إذا كان لديها أسباب معقولة للاعتقاد بأن المشترك قد خالف أي شرط  من الشروط.`,
		`في حال استبعاد أي مشارك من المسابقة، يبقى لـ يونفيرس  وفقاً لتقديرها الخاص أن تقرر ما إذا كان ينبغي اختيار بديل له. وفي هذا الحالة، سيتم تحديد أي مشارك آخر بنفس المعايير التي دخل بها المشارك الأصلي، وسوف يخضع بدوره لهذه الشروط.`,
		`الاشتراك في المسابقة b `,
		`يجب أن يكون الاشتراك في المسابقة وفقا للشروط المقررة والتاريخ والزمن المحددين في إشعار المسابقة. وسيؤدي عدم الالتزام بذلك لاستبعاد المشارك من المسابقة.`,
		`ينبغي أن يدرك المشاركون أنه ما لم ينص على خلاف ذلك، فإن يونفيرس  لا تتحمل مسؤولية عدم تسليم الجوائز من قبل المعلنين ،او أي خلل يحدث يؤدي الى عدم اكتمال الية التسليم .`,
		` b الجوائز`,
		`ما لم ينص على خلاف ذلك في إشعار المسابقة، سيتم اختيار الفائزين بالجائزة عشوائياً من بين جميع المشاركات الصحيحة في المسابقة  بالإضافة الى التزام المشترك بعمل متابعة لكل الصفحات المشتركة في المسابقة و أو التي تقررها يونفيرس`,
		`سيتم إبلاغ الفائزين بالجائزة بالطريقة وخلال الوقت المحددين في إشعار المسابقة (وقد يتم الاتصال بهم من قبل). قد يؤدّي إعادة أي إشعار بالجائزة بسبب عدم  تسلمها  أو عدم الرّد على النحو الموضح في الإشعار (وضمن الوقت المحدد) إلى الاستبعاد واختيار فائز بديل. وإذا تم تقديم أكثر من جائزة، فلن تمنح إلا جائزة واحدة فقط لكل مشارك. قد يتم نشر اسم (أسماء) الفائز (الفائزين) في المسابقة على صفحاتنا .`,
		`يجب أن تتم المطالبات بالجوائز بالطريقة وضمن الوقت المحددين في إشعار المسابقة. عدم المطالبة بالجائزة في الوقت أو بالطريقة المحددة قد يؤدي إلى استبعاد  الفائز واختيار فائز بديل.`,
		`الجوائز غير قابلة للتحويل وليس هناك بديل نقدي. وتحتفظ يونفيرس  بحقها في استبدال الجوائز بأخرى ذات قيمة مساوية أو أكبر في أي وقت.`,
		`يتم منح الجوائز وفقا لتقدير يونفيرس ولن يتم منحها لأي مشارك قام بأفعال غير لائقة بنفسه أو قام بها أحد بالنيابة عنه. حيث يتم تقييم جدارة المشاركات ، وتحتفظ يونفيرس  و/أو حكّام المسابقة (بشكل معقول) بحق عدم تحديد الفائز و/أو إزالة أو تعديل معايير الاختيار و/أو بنية و طريقة المسابقة إذا كانت المشاركات ليست على المستوى المطلوب.`,
		`تكون جميع الضرائب والتأمين والنقل وإنفاق المال وغيره من النفقات (بما في ذلك وجبات الطعام أو نفقات الترقيات الشخصية وما إلى ذلك) وما لم ينص على غير ذلك، تحت المسؤولية التامة للفائز بالجائزة.`,
		`حقوق الملكية الفكرية واستخدام المشاركات b `,
		`تملك يونفيرس وشركائها او من يمثلهم حقوق الملكية الفكرية للمسابق ، ولايجوز إعادة استخدام الأفكار ، او سرقتها قانونيا وسيتم مقاضاة الفاعلين`,
		`يجب أن تكون أية مشاركة وأية معلومة قمت بتقديمها شخصية وتتعلق بك على وجه التحديد. إنك تتعهد بموجبه بأن مشاركتك وكذا جميع المعلومات التي تقوم بتقديمها و/أو توزيعها لا تنتهك الملكية الفكرية، والخصوصية أو أية حقوق أخرى لأي طرف ثالث، و لا تحتوي على أي شيء  فيه تشهير أو  قذف أو فعل  مخل بالآداب العامة أو كل ما هو غير لائق، أو أي شي من المضايقة والتهديد. إذا كان ذلك ملائماً، تحتفظ يونفيرس  بالحق - ولكن ليس الالتزام -  بحجب، تصفية و/أو رصد المعلومات التي قمت بتقديمها أو حذفها أو رفض توزيعها أو إزالتها نهائياً`,
		` b المسؤولية`,
		`لا  تتحمّل يونفيرس  مسؤولية أي ضرر أو خسارة أو إصابة أو خيبة أمل  تلحق بأي مشارك يدخل في المسابقة أو نتيجة لقبول أي جائزة.`,
		`حماية البيانات والدعاية b `,
		`يمكن أن يُطلب من الفائزين المشاركة في نشاط ترويجي، وتحتفظ يونفيرس  بالحق في استخدام أسماء وعناوين الفائزين، وصورهم الفوتوغرافية وتسجيلات الصوت و/أو الفيديو التي تشملهم في أي دعاية.`,
		`لن يتم الكشف عن أية بيانات شخصية تتعلق بالمشاركين لطرف ثالث دون موافقة مسبقة. و تحتفظ  يونفيرس   بالبيانات المتعلقة بالمشاركين  لفترة معقولة بعد نهاية المسابقة لمساعدتها على إدارة المسابقات بشكل متسق و ليتم التعامل مع أية استفسارات بشأن المسابقة.`,
		`الاختصاص القضائي b `,
		`تخضع المسابقة وشروطها  للقانون الفلسطيني  وأي نزاعات تخضع للولاية القضائية الحصرية لمحاكم دولة فلسطين. ولا تدعي يونفيرس  أن المواد على الموقع المتعلقة بهذه المسابقة مناسبة أو متوفرة للاستخدام في مواقع أخرى. و يعتبر الدخول إليها من مناطق تعتبر مضمونها غير قانوني أمر ممنوع منعاً باتاً. وإذا دخلت إلى الموقع من خارج فلسطين ، فأنت مسؤول عن الامتثال لجميع القوانين المحلية`,
	];

	/**
	 * Component constructor
	 *
	 * @param el
	 * @param render
	 * @param layoutConfigService: LayoutConfigService
	 * @param authNoticeService: authNoticeService
	 * @param translationService: TranslationService
	 * @param splashScreenService: SplashScreenService
	 * @param dialog
	 */
	constructor(
		private el: ElementRef,
		private render: Renderer2,
		private layoutConfigService: LayoutConfigService,
		public authNoticeService: AuthNoticeService,
		private translationService: TranslationService,
		private splashScreenService: SplashScreenService,
		public dialog: MatDialog) {
	}

	/**
	 * @ Lifecycle sequences => https://angular.io/guide/lifecycle-hooks
	 */

	/**
	 * On init
	 */
	ngOnInit(): void {
		this.translationService.setLanguage(this.translationService.getSelectedLanguage());
		this.headerLogo = this.layoutConfigService.getLogo();

		this.splashScreenService.hide();
	}

	/**
	 * Open info dialog
	 */
	openInfoDialog() {
		const dialogRef = this.dialog.open(InfoDialogComponent, {
			data: {
				info: this.info,
				title: 'الشروط و الأحكام'
			}
		});
	}

	/**
	 * Load CSS for this specific page only, and destroy when navigate away
	 * @param styleUrl
	 */
	private loadCSS(styleUrl: string) {
		return new Promise((resolve, reject) => {
			const styleElement = document.createElement('link');
			styleElement.href = styleUrl;
			styleElement.type = 'text/css';
			styleElement.rel = 'stylesheet';
			styleElement.onload = resolve;
			this.render.appendChild(this.el.nativeElement, styleElement);
		});
	}
}
